Revit 2026 API

# CorrectionFactorSet Constructor

---

Initializes a new instance of the CorrectionFactorSet class

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public CorrectionFactorSet()
```
```vb
Public Sub New
```
```cpp
public:
CorrectionFactorSet()
```
```fsharp
new : unit -> CorrectionFactorSet
```

#### Reference

CorrectionFactorSet Class

Autodesk.Revit.DB.Electrical Namespace